const clipboardy = require('clipboardy');
// import copy from 'copy-to-clipboard';

const mysql      = require('mysql');


const config = [
  {
    host     : '192.168.1.50',
    user     : 'mysqladmin',
    password : 'Password@1',
    database : 'aohsdb_integ_dev',
    multipleStatements: true
  },
  {
    host     : '192.168.1.50',
    user     : 'mysqladmin',
    password : 'Password@1',
    database : 'aohsdb_dev2',
    multipleStatements: true
  },
]



// === Wrapper to use mysql with Promise
class Database {
    constructor( config ) {
        this.connection = mysql.createConnection( config );
    }
    query( sql, args ) {
        return new Promise( ( resolve, reject ) => {
            this.connection.query( sql, args, ( err, rows ) => {
                if ( err )
                    return reject( err );
                resolve( rows );
            } );
        } );
    }
    close() {
        return new Promise( ( resolve, reject ) => {
            this.connection.end( err => {
                if ( err )
                    return reject( err );
                resolve();
            } );
        } );
    }
}
 
const connection = new Database(config[0])

const data={
  tags2: [
      "IVR",
      "private",
      "Silence",
      "เกี่ยวกับการเซ็นเอกสาร",
      "ขอเลื่อนจ่าย",
      "ขับรถอยู่",
      "คนในครอบครัวป่วย",
      "จะจ่าย",
      "จะช่วยติดต่อให้",
      "จะชำระให้",
      "จะปิดบัญชี",
      "จ่าย",
      "จ่ายแล้ว",
      "แจ้งชำระเพิ่ม",
      "แจ้งนัดชำระ",
      "แจ้งโปรโมชั่น",
      "ชำระจ่ายบางส่วน",
      "ชำระเรียบร้อยแล้ว แต่ยอดยังไม่ขึ้น",
      "ชำระวันนี้",
      "ได้รับใบแจ้งยอดแล้ว",
      "ตกงานอยู่",
      "ตามเอกสาร ประนอมหนี้",
      "ติดงานอยู่ เข้ากะ",
      "ติดต่อลูกค้าไม่ได้",
      "ทำงานในรายการผลิต รับสายไม่ได้",
      "ทำตามระบบก็แล้วกัน",
      "นัดชำระวันนี้",
      "นัดเซ็นเอกสาร",
      "นัดวัน",
      "บุคคลอื่นรับสาย",
      "บุคคลอื่นรับสาย _ คนค้ำ",
      "ประนอมหนี้ ตามยอด",
      "ไปทำงานต่างประเทศ",
      "ฝากคนอื่นไปจ่าย",
      "ฝากติดต่อกลับ",
      "ฟ้องไปเลย",
      "ภาษาใต้",
      "ยังไม่ได้ชำระ กำลังจะไปชำระ",
      "ยังไม่ได้ใบแจ้งยอด",
      "ยังไม่มี ยังหาไม่ได้เลย",
      "ยังไม่สรุปการจ่าย",
      "ย้ายแผนกแล้ว",
      "ย้ายออกจากบริษัทแล้ว",
      "ยื่นกู้อยู่",
      "รอจ่าย",
      "รอติดต่อสอบถามข้อมูลเพิ่มเติม",
      "รอประสานงาน",
      "ลางาน",
      "ลาออกจากบริษัท",
      "ลืมเอาโทรศัพท์ไว้",
      "ลูกค้าป่วย",
      "สอบถาม สถานะพนักงาน",
      "สอบถามข้อมูล",
      "สอบถามเบอร์ลูกค้า จาก บุคคลอื่น",
      "สอบถามรายละเอียด",
      "สอบถามเรื่องเอกสาร",
      "สัญญาณแฟกซ์",
      "เสนอประนอมหนี้",
      "เอกสาร"
  ],
  tags1: ["ไม่เข้าเงื่อนไข", "ลูกค้าติดงานหรือขับรถอยู่ไม่สะดวกคุย", "ลูกค้ารับปากว่าจะชำระ", "ลูกค้าแจ้งชำระแล้ว", "พนักงานสอบถามเอกสารบิลใบแจ้ง", "ลูกค้าพิจารณาประนอมหนี้", "บุคคลที่สามรับสาย", "ลูกค้าอยู่ต่างประเทศ", "ลูกค้าฝากบุคคลอื่นไปจ่าย", "ลูกค้าให้ฟ้องไปเลย", "ลูกค้ายังหาเงินไม่ได้", "ลูกค้ากำลังยื่นกู้", "ลูกค้าป่วย"],
  mappingFromCern:  [
      {
        "word": "IVR",
        "words": [
          "ไม่เข้าเงื่อนไข"
        ]
      },
      {
        "word": "private",
        "words": [
          "ไม่เข้าเงื่อนไข"
        ]
      },
      {
        "word": "Silence",
        "words": [
          "ไม่เข้าเงื่อนไข"
        ]
      },
      {
        "word": "เกี่ยวกับการเซ็นเอกสาร",
        "words": [
          "ไม่เข้าเงื่อนไข"
        ]
      },
      {
        "word": "ขอเลื่อนจ่าย",
        "words": [
          "ไม่เข้าเงื่อนไข"
        ]
      },
      {
        "word": "ขับรถอยู่",
        "words": [
          "ลูกค้าติดงานหรือขับรถอยู่ไม่สะดวกคุย"
        ]
      },
      {
        "word": "คนในครอบครัวป่วย",
        "words": [
          "ไม่เข้าเงื่อนไข"
        ]
      },
      {
        "word": "จะจ่าย",
        "words": [
          "ลูกค้ารับปากว่าจะชำระ"
        ]
      },
      {
        "word": "จะช่วยติดต่อให้",
        "words": [
          "ไม่เข้าเงื่อนไข"
        ]
      },
      {
        "word": "จะชำระให้",
        "words": [
          "ลูกค้ารับปากว่าจะชำระ"
        ]
      },
      {
        "word": "จะปิดบัญชี",
        "words": [
          "ไม่เข้าเงื่อนไข"
        ]
      },
      {
        "word": "จ่าย",
        "words": [
          "ลูกค้ารับปากว่าจะชำระ"
        ]
      },
      {
        "word": "จ่ายแล้ว",
        "words": [
          "ลูกค้าแจ้งชำระแล้ว"
        ]
      },
      {
        "word": "แจ้งชำระเพิ่ม",
        "words": [
          "ไม่เข้าเงื่อนไข"
        ]
      },
      {
        "word": "แจ้งนัดชำระ",
        "words": [
          "ไม่เข้าเงื่อนไข"
        ]
      },
      {
        "word": "แจ้งโปรโมชั่น",
        "words": [
          "ไม่เข้าเงื่อนไข"
        ]
      },
      {
        "word": "ชำระจ่ายบางส่วน",
        "words": [
          "ลูกค้ารับปากว่าจะชำระ"
        ]
      },
      {
        "word": "ชำระเรียบร้อยแล้ว แต่ยอดยังไม่ขึ้น",
        "words": [
          "ลูกค้าแจ้งชำระแล้ว"
        ]
      },
      {
        "word": "ชำระวันนี้",
        "words": [
          "ลูกค้ารับปากว่าจะชำระ"
        ]
      },
      {
        "word": "ได้รับใบแจ้งยอดแล้ว",
        "words": [
          "พนักงานสอบถามเอกสารบิลใบแจ้ง"
        ]
      },
      {
        "word": "ตกงานอยู่",
        "words": [
          "ไม่เข้าเงื่อนไข"
        ]
      },
      {
        "word": "ตามเอกสาร ประนอมหนี้",
        "words": [
          "ลูกค้าพิจารณาประนอมหนี้"
        ]
      },
      {
        "word": "ติดงานอยู่ เข้ากะ",
        "words": [
          "ลูกค้าติดงานหรือขับรถอยู่ไม่สะดวกคุย"
        ]
      },
      {
        "word": "ติดต่อลูกค้าไม่ได้",
        "words": [
          "ไม่เข้าเงื่อนไข"
        ]
      },
      {
        "word": "ทำงานในรายการผลิต รับสายไม่ได้",
        "words": [
          "ไม่เข้าเงื่อนไข"
        ]
      },
      {
        "word": "ทำตามระบบก็แล้วกัน",
        "words": [
          "ไม่เข้าเงื่อนไข"
        ]
      },
      {
        "word": "นัดชำระวันนี้",
        "words": [
          "ลูกค้ารับปากว่าจะชำระ"
        ]
      },
      {
        "word": "นัดเซ็นเอกสาร",
        "words": [
          "ไม่เข้าเงื่อนไข"
        ]
      },
      {
        "word": "นัดวัน",
        "words": [
          "ไม่เข้าเงื่อนไข"
        ]
      },
      {
        "word": "บุคคลอื่นรับสาย",
        "words": [
          "บุคคลที่สามรับสาย"
        ]
      },
      {
        "word": "บุคคลอื่นรับสาย _ คนค้ำ",
        "words": [
          "บุคคลที่สามรับสาย"
        ]
      },
      {
        "word": "ประนอมหนี้ ตามยอด",
        "words": [
          "ลูกค้าพิจารณาประนอมหนี้"
        ]
      },
      {
        "word": "ไปทำงานต่างประเทศ",
        "words": [
          "ลูกค้าอยู่ต่างประเทศ"
        ]
      },
      {
        "word": "ฝากคนอื่นไปจ่าย",
        "words": [
          "ลูกค้าฝากบุคคลอื่นไปจ่าย"
        ]
      },
      {
        "word": "ฝากติดต่อกลับ",
        "words": [
          "ไม่เข้าเงื่อนไข"
        ]
      },
      {
        "word": "ฟ้องไปเลย",
        "words": [
          "ลูกค้าให้ฟ้องไปเลย"
        ]
      },
      {
        "word": "ภาษาใต้",
        "words": [
          "ไม่เข้าเงื่อนไข"
        ]
      },
      {
        "word": "ยังไม่ได้ชำระ กำลังจะไปชำระ",
        "words": [
          "ลูกค้าฝากบุคคลอื่นไปจ่าย"
        ]
      },
      {
        "word": "ยังไม่ได้ใบแจ้งยอด",
        "words": [
          "พนักงานสอบถามเอกสารบิลใบแจ้ง"
        ]
      },
      {
        "word": "ยังไม่มี ยังหาไม่ได้เลย",
        "words": [
          "ลูกค้ายังหาเงินไม่ได้"
        ]
      },
      {
        "word": "ยังไม่สรุปการจ่าย",
        "words": [
          "ไม่เข้าเงื่อนไข"
        ]
      },
      {
        "word": "ย้ายแผนกแล้ว",
        "words": [
          "ไม่เข้าเงื่อนไข"
        ]
      },
      {
        "word": "ย้ายออกจากบริษัทแล้ว",
        "words": [
          "ไม่เข้าเงื่อนไข"
        ]
      },
      {
        "word": "ยื่นกู้อยู่",
        "words": [
          "ลูกค้ากำลังยื่นกู้"
        ]
      },
      {
        "word": "รอจ่าย",
        "words": [
          "ไม่เข้าเงื่อนไข"
        ]
      },
      {
        "word": "รอติดต่อสอบถามข้อมูลเพิ่มเติม",
        "words": [
          "ไม่เข้าเงื่อนไข"
        ]
      },
      {
        "word": "รอประสานงาน",
        "words": [
          "ไม่เข้าเงื่อนไข"
        ]
      },
      {
        "word": "ลางาน",
        "words": [
          "บุคคลที่สามรับสาย"
        ]
      },
      {
        "word": "ลาออกจากบริษัท",
        "words": [
          "บุคคลที่สามรับสาย"
        ]
      },
      {
        "word": "ลืมเอาโทรศัพท์ไว้",
        "words": [
          "บุคคลที่สามรับสาย"
        ]
      },
      {
        "word": "ลูกค้าป่วย",
        "words": [
          "ลูกค้าป่วย"
        ]
      },
      {
        "word": "สอบถาม สถานะพนักงาน",
        "words": [
          "บุคคลที่สามรับสาย"
        ]
      },
      {
        "word": "สอบถามข้อมูล",
        "words": [
          "ไม่เข้าเงื่อนไข"
        ]
      },
      {
        "word": "สอบถามเบอร์ลูกค้า จาก บุคคลอื่น",
        "words": [
          "บุคคลที่สามรับสาย"
        ]
      },
      {
        "word": "สอบถามรายละเอียด",
        "words": [
          "ไม่เข้าเงื่อนไข"
        ]
      },
      {
        "word": "สอบถามเรื่องเอกสาร",
        "words": [
          "ไม่เข้าเงื่อนไข"
        ]
      },
      {
        "word": "สัญญาณแฟกซ์",
        "words": [
          "ไม่เข้าเงื่อนไข"
        ]
      },
      {
        "word": "เสนอประนอมหนี้",
        "words": [
          "ลูกค้าพิจารณาประนอมหนี้"
        ]
      },
      {
        "word": "เอกสาร",
        "words": [
          "ไม่เข้าเงื่อนไข"
        ]
      }
    ],
    keywords: [["19","ส่งคนไปหา","หยาบคาย","Y"],["23","เครดิตบูโร","หยาบคาย","Y"],["28","ระงับการอนุมัติ","หยาบคาย","Y"],["37","ติดแบล็คลิสต์","หยาบคาย","Y"],["46","ไม่ปล่อยวงเงิน","หยาบคาย","Y"],["48","ไม่อนุมัติแล้ว","หยาบคาย","Y"],["52","กวนตีน","หยาบคาย","Y"],["53","กะโหลก","หยาบคาย","Y"],["54","กำพืด","หยาบคาย","Y"],["58","โกหก","หยาบคาย","Y"],["59","ขี้เกียจ","หยาบคาย","Y"],["60","ขี้โกง","หยาบคาย","Y"],["61","ขี้เหนียว","หยาบคาย","Y"],["70","ดูแคลน","หยาบคาย","Y"],["71","ดูถูก","หยาบคาย","Y"],["72","ดูหมิ่น","หยาบคาย","Y"],["73","ตอแหล","หยาบคาย","Y"],["74","เต่าล้านปี","หยาบคาย","Y"],["76","น่าอาย","หยาบคาย","Y"],["77","บรรพบุรุษ","หยาบคาย","Y"],["78","บ้าบอ","หยาบคาย","Y"],["80","ปากดี","หยาบคาย","Y"],["81","พูดมาก","หยาบคาย","Y"],["83","เพ้อเจ้อ","หยาบคาย","Y"],["86","มุสา","หยาบคาย","Y"],["88","รังเกียจ","หยาบคาย","Y"],["89","รำคาญ","หยาบคาย","Y"],["93","ขึ้นสวรรค์","หยาบคาย","Y"],["94","สวรรค์วิมาน","หยาบคาย","Y"],["97","สั่วสั่ว","หยาบคาย","Y"],["99","หน้าด้าน","หยาบคาย","Y"],["100","หน้าไม่อาย","หยาบคาย","Y"],["101","หน้าหนา","หยาบคาย","Y"],["102","หนี้เน่า","หยาบคาย","Y"],["103","หนีไม่พ้น","หยาบคาย","Y"],["104","หนีไม่รอด","หยาบคาย","Y"],["105","หมกเม็ด","หยาบคาย","Y"],["106","หลอกลวง","หยาบคาย","Y"],["110","หายนะ","หยาบคาย","Y"],["111","เหน็บ","หยาบคาย","Y"],["112","เห็บหอย","หยาบคาย","Y"],["114","อดสู","หยาบคาย","Y"],["115","อย่าแผนสูง","หยาบคาย","Y"],["116","อย่ามายอกย้อน","หยาบคาย","Y"],["117","อย่ามาเล่นลิ้น","หยาบคาย","Y"],["118","อย่าเรื่องมาก","หยาบคาย","Y"],["119","อย่ามาเรื่องมาก","หยาบคาย","Y"],["120","อับอาย","หยาบคาย","Y"],["1","ออกติดตาม","ข่มขู่ / แอบอ้าง","Y"],["2","ออกงานติดตาม","ข่มขู่ / แอบอ้าง","Y"],["3","ออกงานเซอร์เวย์","ข่มขู่ / แอบอ้าง","Y"],["4","ออกไปหา","ข่มขู่ / แอบอ้าง","Y"],["5","ออกไปพบ","ข่มขู่ / แอบอ้าง","Y"],["6","สำรวจพื้นที่","ข่มขู่ / แอบอ้าง","Y"],["7","สำรวจบ้าน","ข่มขู่ / แอบอ้าง","Y"],["8","สำรวจที่ทำงาน","ข่มขู่ / แอบอ้าง","Y"],["29","ระงับวงเงิน","ข่มขู่ / แอบอ้าง","Y"],["30","ระงับสินเชื่อ","ข่มขู่ / แอบอ้าง","Y"],["124","ต้องพูดแรง","ข่มขู่ / แอบอ้าง","Y"],["125","ติดบูโร","ข่มขู่ / แอบอ้าง","Y"],["126","บีโอที","ข่มขู่ / แอบอ้าง","Y"],["128","เปิดบิลรอ","ข่มขู่ / แอบอ้าง","Y"],["130","ไม่ให้วงเงินเพิ่ม","ข่มขู่ / แอบอ้าง","Y"],["131","ลงพื้นที่","ข่มขู่ / แอบอ้าง","Y"],["132","ว่าความ","ข่มขู่ / แอบอ้าง","Y"],["133","ส่งคนเข้าไปที่ทำงาน","ข่มขู่ / แอบอ้าง","Y"],["134","ส่งคนเข้าไปที่บ้าน","ข่มขู่ / แอบอ้าง","Y"],["135","ส่งคนเไปพบ","ข่มขู่ / แอบอ้าง","Y"],["136","ส่งคนเข้าไปหา","ข่มขู่ / แอบอ้าง","Y"],["137","ส่งเรื่องขอเข้าพบ","ข่มขู่ / แอบอ้าง","Y"],["138","อยากมีเรื่อง","ข่มขู่ / แอบอ้าง","Y"],["139","อยากมีปัญหา","ข่มขู่ / แอบอ้าง","Y"],["140","เข้าพื้นที่","ข่มขู่ / แอบอ้าง","Y"],["141","แจ้งหัวหน้างานของคุณ","ข่มขู่ / แอบอ้าง","Y"],["142","แจ้งหัวหน้างานคุณ","ข่มขู่ / แอบอ้าง","Y"],["143","ตรวจสอบพื้นที่","ข่มขู่ / แอบอ้าง","Y"],["145","ทำธุรกรรมไม่ได้","ข่มขู่ / แอบอ้าง","Y"],["146","ทำธุรกรรมไม่ผ่าน","ข่มขู่ / แอบอ้าง","Y"],["147","ทำสินเชื่อไม่ได้","ข่มขู่ / แอบอ้าง","Y"],["148","ทำสินเชื่อไม่ผ่าน","ข่มขู่ / แอบอ้าง","Y"],["149","โทรหาฝ่ายบุคคล","ข่มขู่ / แอบอ้าง","Y"],["150","โทรหาหัวหน้างาน","ข่มขู่ / แอบอ้าง","Y"],["151","บังคับคดี","ข่มขู่ / แอบอ้าง","Y"],["152","บัตรถูกยกเลิก","ข่มขู่ / แอบอ้าง","Y"],["153","ไปพบที่ทำงาน","ข่มขู่ / แอบอ้าง","Y"],["154","พิพากษา","ข่มขู่ / แอบอ้าง","Y"],["157","ยกเลิกบัตร","ข่มขู่ / แอบอ้าง","Y"],["158","ยกเลิกวงเงิน","ข่มขู่ / แอบอ้าง","Y"],["162","ส่งงานไปข้างนอก","ข่มขู่ / แอบอ้าง","Y"],["163","ส่งบังคับคดี","ข่มขู่ / แอบอ้าง","Y"],["164","ส่งฟ้อง","ข่มขู่ / แอบอ้าง","Y"],["165","ส่งฟ้องศาล","ข่มขู่ / แอบอ้าง","Y"],["166","ส่งเรื่องไปที่อื่น","ข่มขู่ / แอบอ้าง","Y"],["167","ส่งเรื่องไปบริษัทอื่น","ข่มขู่ / แอบอ้าง","Y"],["168","ส่งเรื่องไปสำนักงานอื่น","ข่มขู่ / แอบอ้าง","Y"],["169","ส่งเรื่องให้ออกงานติดตาม","ข่มขู่ / แอบอ้าง","Y"],["170","ส่งสำนวน","ข่มขู่ / แอบอ้าง","Y"],["171","ส่งออกข้างนอก","ข่มขู่ / แอบอ้าง","Y"],["172","สำนักงานกฏหมาย","ข่มขู่ / แอบอ้าง","Y"],["173","เสียเครดิต","ข่มขู่ / แอบอ้าง","Y"],["174","ให้เจ้าหน้าที่ไป","ข่มขู่ / แอบอ้าง","Y"],["175","ให้ไปเซอร์เวย์","ข่มขู่ / แอบอ้าง","Y"],["176","ออกสินค้าไม่ได้","ข่มขู่ / แอบอ้าง","Y"],["177","อายัติ","ข่มขู่ / แอบอ้าง","Y"],["42","ไม่ต้องผ่อนแล้ว","ประชดประชัน","Y"],["178","ตลอดชีวิต","ประชดประชัน","Y"],["179","โบราณ","ประชดประชัน","Y"],["180","เป็นหนี้ตลอดไป","ประชดประชัน","Y"],["181","พูดดีดี","ประชดประชัน","Y"],["183","ยอกย้อน","ประชดประชัน","Y"],["184","อย่าเยอะ","ประชดประชัน","Y"],["185","โยกโย้","ประชดประชัน","Y"],["186","เรื่องมาก","ประชดประชัน","Y"],["187","ลับหลัง","ประชดประชัน","Y"],["188","ลีลา","ประชดประชัน","Y"],["189","เล่นลิ้น","ประชดประชัน","Y"],["190","เลื่อนลอย","ประชดประชัน","Y"],["191","เหนียวหนี้","ประชดประชัน","Y"],["192","อย่าทำเฉยเมย","ประชดประชัน","Y"],["193","อย่าทำไม่สนใจ","ประชดประชัน","Y"],["194","อย่านิ่งดูดาย","ประชดประชัน","Y"],["195","อย่ามายืดเยื้อ","ประชดประชัน","Y"],["196","ทราบเรื่องหนี้ไหม","ประชดประชัน","Y"],["258","ทราบเรื่องหนี้มั้ย","ประชดประชัน","Y"],["20","เก็บเงินเต็มจำนวน","ไม่เหมาะสม","Y"],["21","เก็บเต็มจำนวน","ไม่เหมาะสม","Y"],["22","เก็บยอดเต็ม","ไม่เหมาะสม","Y"],["25","ขอคุยกับฝ่ายบุคคล","ไม่เหมาะสม","Y"],["26","ขอคุยกับหัวหน้า","ไม่เหมาะสม","Y"],["34","ต้องจ่ายเต็มจำนวน","ไม่เหมาะสม","Y"],["35","ต้องจ่ายปิดบัญชี","ไม่เหมาะสม","Y"],["36","ต้องจ่ายยอดเต็ม","ไม่เหมาะสม","Y"],["38","ไม่ต้องใช้อีก","ไม่เหมาะสม","Y"],["39","ไม่ต้องไปแล้ว","ไม่เหมาะสม","Y"],["40","ไม่ต้องจ่ายแล้ว","ไม่เหมาะสม","Y"],["41","ไม่ต้องทำธุรกรรม","ไม่เหมาะสม","Y"],["44","ไม่ต้องอธิบาย","ไม่เหมาะสม","Y"],["45","ไม่น่าเชื่อ","ไม่เหมาะสม","Y"],["47","ไม่มีก็บอกว่าไม่มี","ไม่เหมาะสม","Y"],["49","ไม่อนุมัติวงเงิน","ไม่เหมาะสม","Y"],["197","ทุจริต","ไม่เหมาะสม","Y"],["198","อย่าขัดขืน","ไม่เหมาะสม","Y"],["199","อย่าดื้อ","ไม่เหมาะสม","Y"],["200","ผู้ใหญ่บ้าน","ไม่เหมาะสม","Y"],["201","กฎหมาย","ไม่เหมาะสม","Y"],["202","กฎหมายทวงหนี้","ไม่เหมาะสม","Y"],["203","แบงก์ชาติ","ไม่เหมาะสม","Y"],["204","พูดดีดีหน่อย","ไม่เหมาะสม","Y"],["205","ไม่ต้องการให้เป็นแบบนี้","ไม่เหมาะสม","Y"],["213","กำกวม","ไม่เหมาะสม","Y"],["214","กู้ไม่ได้","ไม่เหมาะสม","Y"],["215","กู้ไม่ผ่าน","ไม่เหมาะสม","Y"],["216","กู้ยาก","ไม่เหมาะสม","Y"],["217","เก็บยอดเต็มจำนวน","ไม่เหมาะสม","Y"],["218","ขอเข้าไปหา","ไม่เหมาะสม","Y"],["219","ขอเข้าไปหาที่ทำงาน","ไม่เหมาะสม","Y"],["220","ขอเข้าไปหาที่บ้าน","ไม่เหมาะสม","Y"],["221","ขอเข้าไปหาที่ออฟฟิศ","ไม่เหมาะสม","Y"],["222","ขอเข้าพบ","ไม่เหมาะสม","Y"],["223","ขอเข้าพื้นที่","ไม่เหมาะสม","Y"],["224","ขอไปติดต่อ","ไม่เหมาะสม","Y"],["225","ขอไปหา","ไม่เหมาะสม","Y"],["226","ขอสินเชื่อไม่ได้","ไม่เหมาะสม","Y"],["227","ขอสินเชื่อไม่ผ่าน","ไม่เหมาะสม","Y"],["228","ขอสินเชื่อไม่อนุมัติ","ไม่เหมาะสม","Y"],["229","ขออนุญาตเข้าพบ","ไม่เหมาะสม","Y"],["230","ขออนุญาตไปเจรจา","ไม่เหมาะสม","Y"],["231","ขออนุญาตไปหา","ไม่เหมาะสม","Y"],["232","ขึ้นศาล","ไม่เหมาะสม","Y"],["236","ความคิด","ไม่เหมาะสม","Y"],["237","งานซู","ไม่เหมาะสม","Y"],["238","งานเซอร์เวย์","ไม่เหมาะสม","Y"],["239","งานติดตาม","ไม่เหมาะสม","Y"],["240","งานฟ้อง","ไม่เหมาะสม","Y"],["241","จ่ายยอดเต็มเท่านั้น","ไม่เหมาะสม","Y"],["242","ชำระแทนได้ไหม","ไม่เหมาะสม","Y"],["243","ติดตามเข้าไป","ไม่เหมาะสม","Y"],["245","ทุกสถาบันการเงิน","ไม่เหมาะสม","Y"],["246","โทรไปบอกที่บ้าน","ไม่เหมาะสม","Y"],["247","โทรหาทางบ้าน","ไม่เหมาะสม","Y"],["248","ผ่อนบ้านไม่ได้","ไม่เหมาะสม","Y"],["249","ผ่อนรถไม่ได้","ไม่เหมาะสม","Y"],["250","ผ่อนสินค้าไม่ได้","ไม่เหมาะสม","Y"],["251","รับผิดชอบแทนได้ไหม","ไม่เหมาะสม","Y"],["252","อย่าใช้คำพูดแบบนี้","ไม่เหมาะสม","Y"],["253","อย่าใช้น้ำเสียงแบบนี้","ไม่เหมาะสม","Y"],["254","อย่ามาทำแบบนี้","ไม่เหมาะสม","Y"],["255","อย่ามาพูดแบบนี้","ไม่เหมาะสม","Y"],["256","กฏหมาย","Type A:Group 1","Y"]]
}

const task={
  sample: function(){
    connection.query('SELECT 1 + 1 AS solution', function (error, results, fields) {
      if (error) throw error;
      console.log('The solution is: ', results[0].solution);
    })
  },
  test: function(){
    let tags =  data.tags2

    task.joinTags4SQL_tableLike(tags)
    .then(tags4sql=>{
      console.log(tags4sql)
        // connection.query(`SELECT name FROM tags WHERE name IN ${tags4sql}`)

      }
    )
    // .then(namesExist=>{
    //   namesOnly = namesExist.map(n=>n.name)
    //   console.log(namesOnly)
    //   return tags.filter(tag=>{
    //     return namesOnly.indexOf(tag) === -1
    //   })
    // })
    // .then(namesNotExist=>{
    //   console.log(namesNotExist)
    //   return namesNotExist.map(tag=>{
    //     return `INSERT INTO tags (name,created_at,updated_at,parent_id) VALUES ('${tag}',NOW(),NOW(),0);`
    //   })
    //   .join("\n")      
    // })
    // .then(sql=>{
    //   console.log(sql)
    //   connection.query(sql)
    //   .then(result=>
    //     console.log(result)
    //   )      
    // })
    .catch(err=>
      console.log(err)
    )      
  },
  joinTags4SQL: function (tags){
    return new Promise(function(resolve, reject) {
      try{
        str = tags.map(tag=>`'${tag}'`)
        .join(',')

        str = `(${str})`

        resolve(str)
      }catch (e){
        reject(e)
      }
    })
    
  },
  joinTags4SQL_tableLike: function (tags){
    return new Promise(function(resolve, reject) {
      try{
        let str = tags.map(tag=>`SELECT '${tag}' tag`)
        .join(' UNION ')

        str = `
          INSERT INTO tags (name,created_at,updated_at,parent_id)
          SELECT tag,NOW(),NOW(),0 FROM (${str}) a
          LEFT JOIN tags t ON a.tag=t.name
          WHERE name=NULL
        `

        resolve(str)
      }catch (e){
        reject(e)
      }
    })
    
  },
  insertTags: function(){
    let tags =  data.tags2

    task.joinTags4SQL(tags)
    .then(tags4sql=>
      connection.query(`SELECT name FROM tags WHERE name IN ${tags4sql}`)
    )
    .then(namesExist=>{
      namesOnly = namesExist.map(n=>n.name)
      console.log(namesOnly)
      return tags.filter(tag=>{
        return namesOnly.indexOf(tag) === -1
      })
    })
    .then(namesNotExist=>{
      console.log(namesNotExist)
      return namesNotExist.map(tag=>{
        return `INSERT INTO tags (name,created_at,updated_at,parent_id) VALUES ('${tag}',NOW(),NOW(),0);`
      })
      .join("\n")      
    })
    .then(sql=>{
      console.log(sql)
      connection.query(sql)
      .then(result=>
        console.log(result)
      )      
    })
    .catch(err=>
      console.log(err)
    )      
  },
  insertTagsMapping: function(){
    let mappings = data.mappingFromCern
    
    let sql = mappings.map(mapping=>{
      return `INSERT INTO tag_mappings (tag_name,tag_id,created_at,updated_at) VALUES ('${mapping.word}',(SELECT id FROM tags WHERE name='${mapping.words[0]}'),NOW(),NOW());`
    })
    .join("\n")
    console.log(sql)

    connection.query(sql)
    .then(result=>
      console.log(result)
    )      
    .catch(err=>
      console.log(err)
    )      
  },
  getSql_new_keywords_type: function (){
    // keywords = data.keywords.map(function(k){return k[2]})
    return new Promise(function(resolve, reject) {
      try{
        let str = data.keywords.map(arr=>`SELECT '${arr[2]}' name, '${arr[3]}' notify_flag`)
        .join(' UNION ')

        str = `
          INSERT INTO keyword_types (name,notify_flag,created_at,updated_at)
          SELECT a.name,a.notify_flag,NOW(),NOW() FROM (${str}) a
          WHERE a.name NOT IN (SELECT name FROM keyword_types)
        `

        console.log(str)

        resolve(str)
      }catch (e){
        reject(e)
      }
    })
    
  },
  getSql_new_keywords: function (){
    // keywords = data.keywords.map(function(k){return k[2]})
    return new Promise(function(resolve, reject) {
      try{
        let str = data.keywords.map(arr=>`SELECT '${arr[1]}' name, '${arr[3]}' notify_flag,(SELECT id FROM keyword_types WHERE name='${arr[2]}') keyword_type_id`)
        .join(' UNION ')

        str = `
          INSERT INTO keywords (name,notify_flag,created_at,updated_at,keyword_type_id)
          SELECT a.name,a.notify_flag,NOW(),NOW(),keyword_type_id FROM (${str}) a
          WHERE a.name NOT IN (SELECT name FROM keywords)
        `

        console.log(str)

        resolve(str)
      }catch (e){
        reject(e)
      }
    })
    
  },
  getCompareColumns: function (){
    
    let sql = `
      select v.id,v.ani,v.dnis,v.start_time,v.operator_id,r.id id2, r.customer_id,r.sub_operator_id,r.call_result,r.remark,r.created_at
      from voice_logs v left join call_results r 
      on v.id = r.voice_log_id
      where v.start_time between '2018-07-10' and '2018-07-12' 
      AND remark IS NOT NULL
      order by v.extension
    `

    connection.query(sql)
    .then(result0=>{
      // console.log(result)
      let result = result0.filter(r=>{
        let first23digit = r.dnis.slice(1,4)

        if (first23digit.slice(0,2)=='02'){
          first23digit = '02'
        }
        console.log(first23digit)

        if (r.remark.indexOf(first23digit) == -1){
          return true;
        }

        return false
      })

      result = result.map(r=>r.id).join(',')

      result=`select v.id,v.ani,v.dnis,v.start_time,v.operator_id,r.id, r.customer_id,r.sub_operator_id,r.call_result,r.remark,r.created_at,r.id 
      from voice_logs v left join call_results r 
      on v.id = r.voice_log_id
      where v.id IN (${result})
      order by v.extension`

      // console.log(result)
      clipboardy.writeSync(result);
      connection.close()
    })      
    .catch(err=>{
      console.log(err)
      connection.close()
    })   
    
  },


}
 
// === Select One ===
// task.test();
// task.insertTags();
// task.insertTagsMapping();

// task.getSql_new_keywords_type();
//task.getSql_new_keywords();
task.getCompareColumns();

// === End Select ===
 
// connection.end();

// connection.close();


